{"type": "pdf", "file": "ai_research_summary.pdf", "text": "AI Research Summary - Q1 2025\nThis quarter's AI research focused on improving model interpretability, reducing hallucinations in\nLLMs, and integrating multimodal inputs. We evaluated transformer variants, including sparse\nattention models, and explored open-weight fine-tuning strategies. Major findings include significant\nperformance gains using LoRA-based fine-tuning on domain-specific corpora. We also identified key\nrisks in autonomous agents and proposed a new benchmark for multi-agent communication tasks.\n"}
{"type": "email", "file": "customer_feedback.eml", "subject": "Feedback from Acme Corp", "body": "Dear Support Team,\n\nWe are extremely pleased with the latest release. The performance improvements are noticeable, and the new dashboard layout is much more intuitive. One minor issue: the export button seems unresponsive on Safari.\n\nLooking forward to future updates.\n\nBest,\nClaire\n"}
{"type": "pdf", "file": "financial_report_q2.pdf", "text": "Financial Report - Q2 2025\nRevenue increased by 12% compared to Q1 2025, primarily driven by strong cloud service demand.\nOperating expenses remained flat, resulting in improved profit margins. R&D investments rose by\n18% YoY, with major spending in AI infrastructure and chip design. Our guidance for Q3 remains\noptimistic with projected growth in North American and APAC markets.\n"}
{"type": "pdf", "file": "project_retrospective.pdf", "text": "Project Apollo - Retrospective\nProject Apollo successfully delivered its MVP within 3 months. The agile team conducted bi-weekly\nsprints and demo reviews. Key wins included successful integration with the customer CRM and\n98.7% uptime. Challenges included data schema inconsistencies and authentication issues, which\nwere addressed in Sprint 4. Future improvements will focus on observability and automated testing.\n"}
{"type": "email", "file": "project_update.eml", "subject": "Project Titan - Weekly Update", "body": "Hello Team,\n\nHere’s the weekly update on Project Titan:\n- Backend integration with the billing system is complete.\n- Frontend design review passed with minor changes.\n- Remaining task: Load testing scheduled for Friday.\n\nKeep pushing!\n\n- Bob\n"}
{"type": "email", "file": "team_meeting_invite.eml", "subject": "Team Sync - Thursday @ 10 AM", "body": "Hi Team,\n\nThis is a reminder for our weekly sync scheduled for Thursday at 10 AM EST. We will review current sprint progress, discuss blockers, and finalize the roadmap for Q3.\n\nZoom link: https://zoom.us/j/xyz123\n\nBest,\nAlice\n"}
